Revit 2017 API
ReinforcementSettings Class
 Provides access to project-wide reinforcement settings.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2013
Syntax
C#
public class ReinforcementSettings : Element
Visual Basic
Public Class ReinforcementSettings _
	Inherits Element
Visual C++
public ref class ReinforcementSettings : public Element
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.Structure.ReinforcementSettings
See Also
ReinforcementSettings Members
Autodesk.Revit.DB.Structure Namespace